# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EndTreatmentType..::..Create Method
EndTreatmentType Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document) | Creates a new EndTreatmentType in a document. |
| Create(Document, String) | Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter. |

# See Also
EndTreatmentType Class
EndTreatmentType Members
Autodesk.Revit.DB.Structure Namespace